<template>
  <v-container fluid class="ma-0 pa-0">
    <section>
      <div class="ly_contInner">
        <div class="terms_cont">
          <h2 class="terms_cont_ttl">プライバシーポリシー【個人情報保護方針】</h2>
          <p>集中力測定およびポイント管理アプリケーション「with+」（以下、当サイトという）は、個人情報の保護に関する法令等を遵守するとともに、ここに規定するプライバシーポリシーを遵守いたします。</p>
          <section>
            <h3 class="terms_cont_article">1. 個人情報の取得</h3>
            <p>当サイトは、個人情報を適正な手段により取得いたします。当サイトは、このウェブサイトのコンテンツをご利用されるユーザーから、その利用の際に、個人情報を取得することがあります。</p>
          </section>

          <section>
            <h3 class="terms_cont_article">2. 個人情報の利用目的</h3>
            <p>当サイトは、個人情報を以下の目的で利用します。個人情報保護法その他の関連する法令により認められる事由がある場合を除き、ご本人の同意がない限り、この利用目的を超えて個人情報を利用することはありません。</p>
            <ul class="cmp_dodList_01 terms_cont_txt">
              <li>匿名を前提とした、集中力に関する研究論文・成果の発表</li>
              <li>商材、レポートその他の当サイト事業関連または付帯するサービスのご案内</li>
              <li>お問い合せへの対応</li>
              <li>その他、上記の利用目的に付随する目的</li>
            </ul>
          </section>

          <section>
            <h3 class="terms_cont_article">3. 個人情報の第三者への提供</h3>
            <p>当サイトは、個人情報の第三者への提供については、個人情報保護法その他の関連する法令を遵守いたします。</p>
          </section>

          <section>
            <h3 class="terms_cont_article">4. 個人情報の安全管理</h3>
            <p>当サイトは、個人情報を適切に管理し、個人情報の漏洩、滅失、毀損等に対する予防措置を講じます。</p>
          </section>

          <section>
            <h3 class="terms_cont_article">5. 個人情報の利用目的の通知、開示、訂正、利用停止等の求め</h3>
            <p>当サイトは、個人情報について、開示、訂正・追加・削除、利用停止・消去、第三者への提供の停止または利用目的の通知に、そのご本人からのお申出があった場合には、お申出をいただいた方がご本人であることを確認のうえ、個人情報保護法の定めに従い、誠実かつ速やかに対応します。<br>
              なお、お申出が個人情報保護法の定める要件をみたさない場合、または、個人情報保護法その他の法令により、開示等を拒絶することが認められる事由がある場合には、お申出をお断りすることがございますので、あらかじめご了承ください。
              </p>
          </section>

          <section>
            <h3 class="terms_cont_article">6. お問い合せ窓口</h3>
            <p>開示等のお申出、ご意見、ご質問、苦情、その他の個人情報の取扱いに関するお問い合せは、下記ご連絡先にて受け付け致します。</p>
            <p class="terms_cont_txt">
              【住所】<br>
              〒160-0023<br>
              東京都新宿区西新宿7-16-1 石原ビル201<br>
              <br>
              【電子メール】<br>
              ask@ishintai.org<br>
              (受付時間：平日10：00～18：00)
            </p>
          </section>

          <section>
            <h3 class="terms_cont_article">7. 継続的改善</h3>
            <p>当サイトは、個人情報の取扱いに関する運用状況を適宜見直し、継続的な改善に努め、必要に応じて、プライバシーポリシーを変更することがあります。</p>
            <p>
              【免責事項】<br>
              当サイトは情報提供会社における個人情報の利用に関して責任を負わないものとします。
            </p>
          </section>

        </div>

      </div>
    </section>
  </v-container>
</template>
<script>
export default {
  layout: 'protected',
}
</script>